# ==========================================
# Homebrew Bundle - Full Development Suite
# ==========================================

# --- Core Runtimes ---
brew "node"          # Node.js (Corepack source)
brew "go"            # Go
brew "rust"          # Rust (Cargo)
brew "python@3.13"   # Python
brew "uv"            # Python manager
brew "deno"          # Alternative JS runtime

# --- CLI Productivity ---
brew "git"           # Version control
brew "starship"      # Prompt
brew "zoxide"        # Navigation
brew "eza"           # Modern ls
brew "bat"           # Modern cat
brew "fzf"           # Fuzzy search
brew "fd"            # Modern find
brew "ripgrep"       # Modern grep
brew "lazygit"       # TUI for Git
brew "gh"            # GitHub CLI
brew "tmux"          # Terminal multiplexer
brew "yt-dlp"        # Media downloader
brew "chezmoi"       # Dotfiles manager
brew "coreutils"     # GNU File, Shell, and Text utilities

# --- Zsh Plugins (Homebrew) ---
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-you-should-use"
brew "fzf-tab"

# --- Casks (GUI Apps) ---
cask "ghostty"       # Primary Terminal
cask "cursor"        # Primary AI Editor
cask "zed"           # Alternative Fast Editor
cask "fork"          # Git GUI
cask "orbstack"      # Docker (Optional)
cask "macs-fan-control" # Utility
cask "font-maple-mono-nf" # Typography
