# ==========================================
# Homebrew Bundle - Full Development Suite
# ==========================================
# Install Homebrew:
# /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"
# ==========================================

# --- Core Runtimes ---
brew "go"            # Go
brew "rust"          # Rust (Cargo)
brew "fnm"           # Fast Node Manager

# --- CLI Productivity ---
brew "git"           # Version control
brew "git-delta"     # Syntax-highlighting pager for git and diff
brew "git-flow-next" # Modern implementation of Git-flow
brew "git-lfs"       # Versioning large files
brew "git-open"      # Open GitHub webpages from terminal
brew "starship"      # Prompt
brew "zoxide"        # Navigation
brew "eza"           # Modern ls
brew "bat"           # Modern cat
brew "fzf"           # Fuzzy search
brew "fd"            # Modern find
brew "ripgrep"       # Modern grep
brew "lazygit"       # TUI for Git
brew "gh"            # GitHub CLI
brew "tmux"          # Terminal multiplexer
brew "yt-dlp"        # Media downloader
brew "chezmoi"       # Dotfiles manager
brew "gnupg"         # GPG encryption
brew "pinentry-mac"  # macOS GPG pinentry
brew "mole"          # Deep clean and optimize your Mac

# --- Zsh Plugins (Homebrew) ---
tap "fradser/brew"
brew "fradser/brew/evalcache"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-you-should-use"
brew "fzf-tab"

# --- Casks (GUI Apps) ---
cask "ghostty"       # Primary Terminal
cask "cursor"        # Primary AI Editor
cask "zed"           # Alternative Fast Editor
cask "font-maple-mono-nf-cn" # Typography (with CN support)
cask "google-chrome" # Browser
