# ==========================================
# Homebrew Bundle - Development Environment
# ==========================================

# --- Taps ---
tap "homebrew/bundle"
tap "homebrew/services"

# --- Formulae (CLI Tools) ---
brew "starship"      # Prompt
brew "zoxide"        # Fast directory navigation (cd replacement)
brew "eza"           # Modern ls replacement
brew "bat"           # Syntax highlighting cat
brew "fzf"           # Fuzzy finder
brew "node"          # Node.js runtime (Homebrew version)
brew "go"            # Go programming language
brew "uv"            # Python environment manager
brew "chezmoi"       # Dotfiles manager
brew "zsh-completions" # Extra completions for zsh

# Zsh Plugins from Homebrew
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"
brew "zsh-autopair"
brew "you-should-use"

# --- Casks (GUI Apps) ---
cask "cursor"        # AI-powered code editor (Primary)
cask "ghostty"       # Modern GPU-accelerated terminal (Replacement for iTerm2)

# Optional / Manual Install
# cask "orbstack"    # Docker & Linux VM (Commented out as per preference)
# cask "iterm2"      # (Replaced by Ghostty)

# --- Global Configs ---
# brew "git"          # Ensure latest git
