# ==========================================
# Homebrew Bundle - Development Environment
# ==========================================

# --- Taps ---
tap "homebrew/bundle"
tap "homebrew/services"

# --- Formulae (CLI Tools) ---
brew "starship"      # Prompt
brew "zoxide"        # Fast directory navigation (cd replacement)
brew "eza"           # Modern ls replacement
brew "bat"           # Syntax highlighting cat
brew "fzf"           # Fuzzy finder
brew "pnpm"          # Node.js package manager
brew "uv"            # Python environment manager
brew "chezmoi"       # Dotfiles manager
brew "zsh-completions" # Extra completions for zsh

# Zsh Plugins from Homebrew
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"
brew "zsh-autopair"
brew "you-should-use"

# --- Casks (GUI Apps) ---
cask "cursor"        # AI-powered code editor
cask "orbstack"      # Fast Docker & Linux VM replacement
cask "visual-studio-code" # Optional: VS Code core
cask "iterm2"        # Optional: Enhanced Terminal

# --- Global Configs ---
# brew "git"          # Ensure latest git
